/*
Написать программу решения квадратного уравнения.
Программа должна проверять правильность исходных данных и в случае,
если коэффициент при второй степени неизвестного равен нулю,
выводить соответствующее сообщение
*/


#include <iostream>
#include <cmath>
using namespace std;
int main()
{
    setlocale(LC_ALL, "Russian");
    // Объявление переменных для коэффициентов уравнения
    double a, b, c;

    // Ввод коэффициентов
    std::cout << "Введите коэффициент a: ";
    std::cin >> a;

    std::cout << "Введите коэффициент b: ";
    std::cin >> b;

    std::cout << "Введите коэффициент c: ";
    std::cin >> c;

    // Проверка на правильность исходных данных
    if (a == 0) {
        std::cout << "Коэффициент при второй степени неизвестного не может быть равен нулю. Уравнение не квадратное.\n";
        return 0;
    }

    // Вычисление дискриминанта
    double discriminant = b * b - 4 * a * c;

    // Проверка дискриминанта
    if (discriminant > 0) {
        // Два корня
        double x1 = (-b + sqrt(discriminant)) / (2 * a);
        double x2 = (-b - sqrt(discriminant)) / (2 * a);
        std::cout << "Уравнение имеет два корня:\n";
        std::cout << "Первый корень = " << x1 << "\n";
        std::cout << "Второй корень = " << x2 << "\n";
    }
    else if (discriminant == 0) {
        // Один корень
        double x = -b / (2 * a);
        std::cout << "Уравнение имеет один корень:\n";
        std::cout << "Корень = " << x << "\n";
    }
    else {
        std::cout << "У уравнения нет действительных корней.\n";
    }

    system("pause");
    return 0;
}
