#include <iostream>

/*
Написать программу, которая сравнивает два введённых с клавиатуры числа.
Программа должна указать, какое число больше или, если числа равны, вывести соответствующее сообщение.
*/

using namespace std;
int main()
{
    setlocale(LC_ALL, "Russian");
    // Объявление переменных для хранения введенных чисел
    double number1, number2;

    // Ввод первого числа
    std::cout << "Введите ваше первое число: ";
    std::cin >> number1;

    // Ввод второго числа
    std::cout << "Введите ваше второе число: ";
    std::cin >> number2;

    // Сравнение чисел и вывод результата
    if (number1 > number2) {
        std::cout << "Первое число больше чем второе число\n";
    }
    else if (number1 < number2) {
        std::cout << "Второе число больше чем первое число\n";
    }
    else {
        std::cout << "Числа одинаковы\n";
    }

    system("pause");
    return 0;
}
